clear
clc

% № 3
count = 5;
mu = 1:5;
sigma = 2;
n = 50:10:90;
alpha = 0.05;
X_1 = normrnd(mu(1), sigma, 1, n(1));
X_2 = normrnd(mu(2), sigma, 1, n(2));
X_3 = normrnd(mu(3), sigma, 1, n(3));
X_4 = normrnd(mu(4), sigma, 1, n(4));
X_5 = normrnd(mu(5), sigma, 1, n(5));

s_2 = 1:5;
s_2(1) = var(X_1);
s_2(2) = var(X_2);
s_2(3) = var(X_3);
s_2(4) = var(X_4);
s_2(5) = var(X_5);

% Число степеней свободы
k(1) = n(1) - 1;
k(2) = n(2) - 1;
k(3) = n(3) - 1;
k(4) = n(4) - 1;
k(5) = n(5) - 1;

% Средняя арифметическая исправленных дисперсий,
% взвешенная по числам степеней свободы
S = sum(k.* s_2) / sum(k);

% V
sumV = sum(k.* log10(s_2));
V = 2.303 * (sum(k) * log10(S) - sumV);

B_cr = chi2inv(1 - alpha, count - 1);

% Замечание
if (V < B_cr)
    disp('3.1 Принимаем H0: D(X_1) = D(X_2) = D(X_3) = D(X_4) = D(X_5)');
else
    sumC = sum(1./ k) - 1 / sum(k);
    C = 1 + (1 / (3 * (count - 1))) * sumC;
% Случайная величина (критерий Бартлетта)
% распределена приближенно как хи-квадрат с l-1 степеней свободы
% наблюдаемое значение критерия
B = V / C;
if (B < B_cr)
    disp('3.1 Принимаем H0: D(X_1) = D(X_2) = D(X_3) = D(X_4) = D(X_5)');
else
    disp('3.1 Принимаем H1: не все дисперсии равны');
end
end


